#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть словарь кодов товаров

goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

# Есть словарь списков количества товаров на складе.

store = {
    '12345': [
        {'quantity': 27, 'price': 42},
    ],
    '23456': [
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
    ],
}

# Рассчитать на какую сумму лежит каждого товара на складе
# например для ламп

lamps_cost = store[goods['Лампа']][0]['quantity'] * store[goods['Лампа']][0]['price']
# или проще (/сложнее ?)
lamp_code = goods['Лампа']
lamps_item = store[lamp_code][0]
lamps_quantity = lamps_item['quantity']
lamps_price = lamps_item['price']
lamps_cost = lamps_quantity * lamps_price
print('Лампа -', lamps_quantity, 'шт, стоимость', lamps_cost, 'руб')

# Вывести стоимость каждого вида товара на складе:
# один раз распечать сколько всего столов и их общая стоимость,
# один раз распечать сколько всего стульев и их общая стоимость,
#   и т.д. на складе
# Формат строки <товар> - <кол-во> шт, стоимость <общая стоимость> руб

# WARNING для знающих циклы: БЕЗ циклов. Да, с переменными; да, неэффективно; да, копипаста.
# Это задание на ручное вычисление - что бы потом понять как работают циклы и насколько с ними проще жить.

table_code = goods['Стол']
table_qty1 = store[table_code][0]['quantity']
table_price1 = store[table_code][0]['price']
table_qty2 = store[table_code][1]['quantity']
table_price2 = store[table_code][1]['price']
total_table_qty = table_qty1 + table_qty2
total_table_cost = table_qty1 * table_price1 + table_qty2 * table_price2
print('Стол -', total_table_qty, 'шт, стоимость', total_table_cost, 'руб')

sofa_code = goods['Диван']
sofa_qty1 = store[sofa_code][0]['quantity']
sofa_price1 = store[sofa_code][0]['price']
sofa_qty2 = store[sofa_code][1]['quantity']
sofa_price2 = store[sofa_code][1]['price']
total_sofa_qty = sofa_qty1 + sofa_qty2
total_sofa_cost = sofa_qty1 * sofa_price1 + sofa_qty2 * sofa_price2
print('Диван -', total_sofa_qty, 'шт, стоимость', total_sofa_cost, 'руб')

chair_code = goods['Стул']
chair_qty1 = store[chair_code][0]['quantity']
chair_price1 = store[chair_code][0]['price']
chair_qty2 = store[chair_code][1]['quantity']
chair_price2 = store[chair_code][1]['price']
chair_qty3 = store[chair_code][2]['quantity']
chair_price3 = store[chair_code][2]['price']
total_chair_qty = chair_qty1 + chair_qty2 + chair_qty3
total_chair_cost = (chair_qty1 * chair_price1 +
                    chair_qty2 * chair_price2 +
                    chair_qty3 * chair_price3)
print('Стул -', total_chair_qty, 'шт, стоимость', total_chair_cost, 'руб')
